kicer/ksloop/bsp/inc/hc32l130j8ta.h
typedef struct
{
    __IO uint32_t PB00                      : 1;
    __IO uint32_t PB01                      : 1;
    __IO uint32_t PB02                      : 1;
    __IO uint32_t PB03                      : 1;
    __IO uint32_t PB04                      : 1;
    __IO uint32_t PB05                      : 1;
    __IO uint32_t PB06                      : 1;
    __IO uint32_t PB07                      : 1;
    __IO uint32_t PB08                      : 1;
    __IO uint32_t PB09                      : 1;
    __IO uint32_t PB10                      : 1;
    __IO uint32_t PB11                      : 1;
    __IO uint32_t PB12                      : 1;
    __IO uint32_t PB13                      : 1;
    __IO uint32_t PB14                      : 1;
    __IO uint32_t PB15                      : 1;
} stc_gpio_pbfie_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcdir_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcin_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcout_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcads_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcbset_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcbclr_field_t;

typedef struct
{
    __IO uint32_t PCBCLR                    :16;
    __IO uint32_t PCBSET                    :16;
} stc_gpio_pcbsetclr_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcdr_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcpu_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcpd_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcod_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pchie_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pclie_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcrie_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pcfie_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pddir_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdin_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdout_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdads_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdbset_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdbclr_field_t;

typedef struct
{
    __IO uint32_t PDBCLR                    : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t PDBSET                    : 8;
} stc_gpio_pdbsetclr_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pddr_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdpu_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdpd_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdod_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdhie_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdlie_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdrie_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pdfie_field_t;

typedef struct
{
    __IO uint32_t PA00                      : 1;
    __IO uint32_t PA01                      : 1;
    __IO uint32_t PA02                      : 1;
    __IO uint32_t PA03                      : 1;
    __IO uint32_t PA04                      : 1;
    __IO uint32_t PA05                      : 1;
    __IO uint32_t PA06                      : 1;
    __IO uint32_t PA07                      : 1;
    __IO uint32_t PA08                      : 1;
    __IO uint32_t PA09                      : 1;
    __IO uint32_t PA10                      : 1;
    __IO uint32_t PA11                      : 1;
    __IO uint32_t PA12                      : 1;
    __IO uint32_t PA13                      : 1;
    __IO uint32_t PA14                      : 1;
    __IO uint32_t PA15                      : 1;
} stc_gpio_pa_stat_field_t;

typedef struct
{
    __IO uint32_t PA00                      : 1;
    __IO uint32_t PA01                      : 1;
    __IO uint32_t PA02                      : 1;
    __IO uint32_t PA03                      : 1;
    __IO uint32_t PA04                      : 1;
    __IO uint32_t PA05                      : 1;
    __IO uint32_t PA06                      : 1;
    __IO uint32_t PA07                      : 1;
    __IO uint32_t PA08                      : 1;
    __IO uint32_t PA09                      : 1;
    __IO uint32_t PA10                      : 1;
    __IO uint32_t PA11                      : 1;
    __IO uint32_t PA12                      : 1;
    __IO uint32_t PA13                      : 1;
    __IO uint32_t PA14                      : 1;
    __IO uint32_t PA15                      : 1;
} stc_gpio_pa_iclr_field_t;

typedef struct
{
    __IO uint32_t PB00                      : 1;
    __IO uint32_t PB01                      : 1;
    __IO uint32_t PB02                      : 1;
    __IO uint32_t PB03                      : 1;
    __IO uint32_t PB04                      : 1;
    __IO uint32_t PB05                      : 1;
    __IO uint32_t PB06                      : 1;
    __IO uint32_t PB07                      : 1;
    __IO uint32_t PB08                      : 1;
    __IO uint32_t PB09                      : 1;
    __IO uint32_t PB10                      : 1;
    __IO uint32_t PB11                      : 1;
    __IO uint32_t PB12                      : 1;
    __IO uint32_t PB13                      : 1;
    __IO uint32_t PB14                      : 1;
    __IO uint32_t PB15                      : 1;
} stc_gpio_pb_stat_field_t;

typedef struct
{
    __IO uint32_t PB00                      : 1;
    __IO uint32_t PB01                      : 1;
    __IO uint32_t PB02                      : 1;
    __IO uint32_t PB03                      : 1;
    __IO uint32_t PB04                      : 1;
    __IO uint32_t PB05                      : 1;
    __IO uint32_t PB06                      : 1;
    __IO uint32_t PB07                      : 1;
    __IO uint32_t PB08                      : 1;
    __IO uint32_t PB09                      : 1;
    __IO uint32_t PB10                      : 1;
    __IO uint32_t PB11                      : 1;
    __IO uint32_t PB12                      : 1;
    __IO uint32_t PB13                      : 1;
    __IO uint32_t PB14                      : 1;
    __IO uint32_t PB15                      : 1;
} stc_gpio_pb_iclr_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pc_stat_field_t;

typedef struct
{
    uint32_t RESERVED0                      :13;
    __IO uint32_t PC13                      : 1;
    __IO uint32_t PC14                      : 1;
    __IO uint32_t PC15                      : 1;
} stc_gpio_pc_iclr_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pd_stat_field_t;

typedef struct
{
    __IO uint32_t PD00                      : 1;
    __IO uint32_t PD01                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PD03                      : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PD06                      : 1;
    __IO uint32_t PD07                      : 1;
} stc_gpio_pd_iclr_field_t;

typedef struct
{
    __IO uint32_t IESEL                     : 1;
} stc_gpio_ctrl0_field_t;

typedef struct
{
    __IO uint32_t EXT_CLK_SEL               : 4;
    __IO uint32_t SSN0_SEL                  : 4;
    __IO uint32_t PCLK_SEL                  : 2;
    __IO uint32_t HCLK_SEL                  : 2;
    __IO uint32_t PCLK_EN                   : 1;
    __IO uint32_t HCLK_EN                   : 1;
    __IO uint32_t IR_POL                    : 1;
} stc_gpio_ctrl1_field_t;

typedef struct
{
    __IO uint32_t SSN1_SEL                  : 4;
    uint32_t RESERVED4                      :11;
    __IO uint32_t AHB_SEL                   : 1;
} stc_gpio_ctrl2_field_t;

typedef struct
{
    __IO uint32_t TIM0_G                    : 3;
    __IO uint32_t TIM1_G                    : 3;
    __IO uint32_t TIM2_G                    : 3;
    __IO uint32_t TIM3_G                    : 3;
    __IO uint32_t LPTIM_G                   : 3;
} stc_gpio_timgs_field_t;

typedef struct
{
    __IO uint32_t TIM0_E                    : 3;
    __IO uint32_t TIM1_E                    : 3;
    __IO uint32_t TIM2_E                    : 3;
    __IO uint32_t TIM3_E                    : 3;
    __IO uint32_t LPTIM_E                   : 3;
} stc_gpio_times_field_t;

typedef struct
{
    __IO uint32_t TIM0_CA                   : 3;
    __IO uint32_t TIM1_CA                   : 3;
    __IO uint32_t TIM2_CA                   : 3;
    __IO uint32_t TIM3_CA                   : 3;
    __IO uint32_t TIM3_CB                   : 3;
} stc_gpio_timcps_field_t;

typedef struct
{
    __IO uint32_t PCA_CH0                   : 3;
    __IO uint32_t PCA_ECI                   : 3;
} stc_gpio_pcas_field_t;

typedef struct
{
    __IO uint32_t DIVIDEND                  :32;
} stc_hdiv_dividend_field_t;

typedef struct
{
    __IO uint32_t DIVISOR                   :16;
} stc_hdiv_divisor_field_t;

typedef struct
{
    __IO uint32_t QUOTIENT                  :32;
} stc_hdiv_quotient_field_t;

typedef struct
{
    __IO uint32_t REMAINDER                 :32;
} stc_hdiv_remainder_field_t;

typedef struct
{
    __IO uint32_t SIGN                      : 1;
} stc_hdiv_sign_field_t;

typedef struct
{
    __IO uint32_t END                       : 1;
    __IO uint32_t ZERO                      : 1;
} stc_hdiv_stat_field_t;

typedef struct
{
    __IO uint32_t TME                       : 1;
} stc_i2c_tmrun_field_t;

typedef struct
{
    __IO uint32_t TM                        : 8;
} stc_i2c_tm_field_t;

typedef struct
{
    __IO uint32_t H1M                       : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t AA                        : 1;
    __IO uint32_t SI                        : 1;
    __IO uint32_t STO                       : 1;
    __IO uint32_t STA                       : 1;
    __IO uint32_t ENS                       : 1;
} stc_i2c_cr_field_t;

typedef struct
{
    __IO uint32_t DAT                       : 8;
} stc_i2c_data_field_t;

typedef struct
{
    __IO uint32_t GC                        : 1;
    __IO uint32_t ADR                       : 7;
} stc_i2c_addr_field_t;

typedef struct
{
    __IO uint32_t STA                       : 8;
} stc_i2c_stat_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
} stc_lptimer_cnt_field_t;

typedef struct
{
    __IO uint32_t ARR                       :16;
} stc_lptimer_arr_field_t;

typedef struct
{
    __IO uint32_t TR                        : 1;
    __IO uint32_t MD                        : 1;
    __IO uint32_t CT                        : 1;
    __IO uint32_t TOG_EN                    : 1;
    __IO uint32_t TCK_SEL                   : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t WT_FLAG                   : 1;
    __IO uint32_t GATE                      : 1;
    __IO uint32_t GATE_P                    : 1;
    __IO uint32_t IE                        : 1;
} stc_lptimer_cr_field_t;

typedef struct
{
    __IO uint32_t TF                        : 1;
} stc_lptimer_ifr_field_t;

typedef struct
{
    __IO uint32_t TFC                       : 1;
} stc_lptimer_iclr_field_t;

typedef struct
{
    __IO uint32_t DATA                      : 8;
    __IO uint32_t DATA8                     : 1;
} stc_lpuart_sbuf_field_t;

typedef struct
{
    __IO uint32_t RCIE                      : 1;
    __IO uint32_t TCIE                      : 1;
    __IO uint32_t B8CONT                    : 2;
    __IO uint32_t REN                       : 1;
    __IO uint32_t ADRDET                    : 1;
    __IO uint32_t SM                        : 2;
    __IO uint32_t TXEIE                     : 1;
    __IO uint32_t OVER                      : 2;
    __IO uint32_t SCLKSEL                   : 2;
    __IO uint32_t PEIE                      : 1;
    __IO uint32_t STOPBIT                   : 2;
    __IO uint32_t DMARXEN                   : 1;
    __IO uint32_t DMATXEN                   : 1;
    __IO uint32_t RTSEN                     : 1;
    __IO uint32_t CTSEN                     : 1;
    __IO uint32_t CTSIE                     : 1;
    __IO uint32_t FEIE                      : 1;
} stc_lpuart_scon_field_t;

typedef struct
{
    __IO uint32_t SADDR                     : 8;
} stc_lpuart_saddr_field_t;

typedef struct
{
    __IO uint32_t SADEN                     : 8;
} stc_lpuart_saden_field_t;

typedef struct
{
    __IO uint32_t RC                        : 1;
    __IO uint32_t TC                        : 1;
    __IO uint32_t FE                        : 1;
    __IO uint32_t TXE                       : 1;
    __IO uint32_t PE                        : 1;
    __IO uint32_t CTSIF                     : 1;
    __IO uint32_t CTS                       : 1;
} stc_lpuart_isr_field_t;

typedef struct
{
    __IO uint32_t RCCF                      : 1;
    __IO uint32_t TCCF                      : 1;
    __IO uint32_t FECF                      : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t PECF                      : 1;
    __IO uint32_t CTSIFCF                   : 1;
} stc_lpuart_icr_field_t;

typedef struct
{
    __IO uint32_t SCNT                      :16;
} stc_lpuart_scnt_field_t;

typedef struct
{
    __IO uint32_t LVDEN                     : 1;
    __IO uint32_t ACT                       : 1;
    __IO uint32_t SOURCE_SEL                : 2;
    __IO uint32_t VTDS                      : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FTEN                      : 1;
    __IO uint32_t RTEN                      : 1;
    __IO uint32_t HTEN                      : 1;
    __IO uint32_t IE                        : 1;
} stc_lvd_cr_field_t;

typedef struct
{
    __IO uint32_t INTF                      : 1;
    __IO uint32_t FILTER                    : 1;
} stc_lvd_ifr_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t AZEN                      : 1;
    __IO uint32_t MODE                      : 1;
    __IO uint32_t UBUFSEL                   : 1;
    __IO uint32_t RESSEL                    : 1;
    __IO uint32_t BIASSEL                   : 3;
    __IO uint32_t NEGSEL                    : 2;
    __IO uint32_t POSSEL                    : 2;
    __IO uint32_t PGAGAIN                   : 3;
    __IO uint32_t POEN                      : 1;
    __IO uint32_t RESINMUX                  : 2;
} stc_opa_cr0_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t AZEN                      : 1;
    __IO uint32_t MODE                      : 1;
    __IO uint32_t UBUFSEL                   : 1;
    __IO uint32_t RESSEL                    : 1;
    __IO uint32_t BIASSEL                   : 3;
    __IO uint32_t NEGSEL                    : 2;
    __IO uint32_t POSSEL                    : 2;
    __IO uint32_t PGAGAIN                   : 3;
    __IO uint32_t POEN                      : 1;
    __IO uint32_t RESINMUX                  : 2;
} stc_opa_cr1_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t AZEN                      : 1;
    __IO uint32_t MODE                      : 1;
    __IO uint32_t UBUFSEL                   : 1;
    __IO uint32_t RESSEL                    : 1;
    __IO uint32_t BIASSEL                   : 3;
    __IO uint32_t NEGSEL                    : 2;
    __IO uint32_t POSSEL                    : 2;
    __IO uint32_t PGAGAIN                   : 3;
    __IO uint32_t POEN                      : 1;
    __IO uint32_t RESINMUX                  : 2;
} stc_opa_cr2_field_t;

typedef struct
{
    __IO uint8_t ADCTR_EN                   : 1;
    __IO uint8_t TRIGGER                    : 1;
    __IO uint8_t AZ_PULSE                   : 1;
    __IO uint8_t CLK_SW_SET                 : 1;
    __IO uint8_t CLK_SEL                    : 4;
} stc_opa_cr_field_t;

typedef struct
{
    __IO uint32_t CCF0                      : 1;
    __IO uint32_t CCF1                      : 1;
    __IO uint32_t CCF2                      : 1;
    __IO uint32_t CCF3                      : 1;
    __IO uint32_t CCF4                      : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t CR                        : 1;
    __IO uint32_t CF                        : 1;
} stc_pca_ccon_field_t;

